# **Data Science Learners Hub**

**Module : SQL**

**Topic :** **Playground**

**email** : [datasciencelearnershub@gmail.com](mailto:datasciencelearnershub@gmail.com)

In [1]:
USE DataScienceLearnersHub

In [2]:
SELECT * FROM Emp

id,name,age,gender,salary,department,MonthlySalary,EmailAddress,FullName
1,Rajesh,30,Male,60000.00,IT,5000.000000,Rajesh_1@company.com,Rajesh IT
3,Laxman,35,Male,70000.75,Finance,5833.395833,Laxman_3@company.com,Laxman Finance
4,Ganga,28,Female,48000.25,Marketing,4000.020833,Ganga_4@company.com,Ganga Marketing
5,Nikhil,32,Male,72000.00,IT,6000.000000,Nikhil_5@company.com,Nikhil IT
6,Sarita,29,Female,58000.75,HR,4833.395833,Sarita_6@company.com,Sarita HR
7,Bunny,40,Male,85000.50,Finance,7083.375000,Bunny_7@company.com,Bunny Finance
8,Namrata,26,Female,50000.50,Marketing,4166.708333,Namrata_8@company.com,Namrata Marketing
9,Abhiram,38,Male,78000.25,IT,6500.020833,Abhiram_9@company.com,Abhiram IT
10,Tikram,31,Female,62000.00,Finance,5166.666666,Tikram_10@company.com,Tikram Finance
11,Ramulu,58,Male,178000.25,IT,14833.354166,Ramulu_11@company.com,Ramulu IT
12,Bala,51,Female,162000.00,Finance,13500.000000,Bala_12@company.com,Bala Finance
16,Arjun,31,NULL,NULL,NULL,NULL,Arjun_16@company.com,Arjun

In [4]:
CREATE TABLE delete_me
    (
        ename VARCHAR(20),
        age INT
    )

In [5]:
INSERT INTO delete_me
SELECT name, age FROM Emp

In [7]:
INSERT INTO delete_me(ename)
SELECT name FROM Emp

Sure, let's combine all the string functions into a single table and categorize them within the table. This will provide a comprehensive view of all the string functions and their details in one place.

### Combined String Functions Table

| Category                  | Function       | Syntax                                     | Input               | Return Type       | One-line Explanation                                     | Peculiarities/Considerations                              |
|---------------------------|----------------|--------------------------------------------|---------------------|-------------------|----------------------------------------------------------|----------------------------------------------------------|
| **Length and Size**       | LEN()          | `LEN(expression)`                          | String              | Integer           | Returns the number of characters in a string.            | Does not include trailing spaces.                         |
|                           | DATALENGTH()   | `DATALENGTH(expression)`                   | String/Binary       | Integer           | Returns the number of bytes used to represent an expression. | Includes trailing spaces. Useful for binary data.        |
| **Case**                  | UPPER()        | `UPPER(expression)`                        | String              | String            | Converts all characters to uppercase.                    | None                                                     |
|                           | LOWER()        | `LOWER(expression)`                        | String              | String            | Converts all characters to lowercase.                    | None                                                     |
| **Substring and Position**| SUBSTRING()    | `SUBSTRING(expression, start, length)`     | String, Int, Int    | String            | Extracts a substring from a string.                      | `start` is 1-based index.                                |
|                           | CHARINDEX()    | `CHARINDEX(search_expression, expression)` | String, String      | Integer           | Returns the starting position of a substring.            | Returns 0 if not found.                                  |
| **Concatenation**         | CONCAT()       | `CONCAT(expression1, expression2, ...)`    | String              | String            | Concatenates two or more strings.                        | NULL values are treated as empty strings.                |
|                           | STRING_AGG()   | `STRING_AGG(expression, separator)`        | String, String      | String            | Concatenates values with a separator.                    | Available in SQL Server 2017 and later.                  |
| **Trimming**              | LTRIM()        | `LTRIM(expression)`                        | String              | String            | Removes leading spaces from a string.                    | None                                                     |
|                           | RTRIM()        | `RTRIM(expression)`                        | String              | String            | Removes trailing spaces from a string.                   | None                                                     |
| **Left and Right**        | LEFT()         | `LEFT(expression, number)`                 | String, Int         | String            | Returns the left part of a string.                       | `number` specifies how many characters to return.        |
|                           | RIGHT()        | `RIGHT(expression, number)`                | String, Int         | String            | Returns the right part of a string.                      | `number` specifies how many characters to return.        |
| **Replacement**           | REPLACE()      | `REPLACE(expression, search, replace)`     | String, String, String | String        | Replaces all occurrences of a substring.                | Case-sensitive.                                          |
| **Miscellaneous**         | STUFF()        | `STUFF(expression, start, length, replace)`| String, Int, Int, String | String | Deletes part of a string and inserts another.            | `start` is 1-based index.                                |
|                           | REPLICATE()    | `REPLICATE(expression, count)`             | String, Int         | String            | Repeats a string a specified number of times.            | None                                                     |
|                           | SPACE()        | `SPACE(count)`                             | Int                 | String            | Returns a string of repeated spaces.                     | None                                                     |
| **Conversion**            | CONVERT()      | `CONVERT(data_type, expression)`           | Any                 | Specified data type | Converts a value to a specified data type.               | Commonly used for date and string conversions.           |
|                           | CAST()         | `CAST(expression AS data_type)`            | Any                 | Specified data type | Converts a value to a specified data type.               | Standard SQL syntax for conversions.                     |
| **Parsing**               | PARSE()        | `PARSE(expression AS data_type)`           | String              | Specified data type | Converts a string to a specified data type.              | Suitable for converting string representations of dates and numbers. |
|                           | TRY_PARSE()    | `TRY_PARSE(expression AS data_type)`       | String              | Specified data type | Tries to convert a string to a specified data type.      | Returns NULL if conversion fails, avoiding errors.       |

### Sample Table to Explain Functions with Examples

Let's use the sample `students` table to illustrate these functions:

```sql
CREATE TABLE students (
    id INT,
    name VARCHAR(50),
    address VARCHAR(100)
);

INSERT INTO students (id, name, address) VALUES 
(1, 'Alice Johnson', '123 Main St'),
(2, 'Bob Smith', '456 Oak St'),
(3, 'Carol O\'Connor', '789 Pine St');
```

#### Examples

**Length and Size Functions**:
```sql
SELECT LEN(name) AS NameLength, DATALENGTH(name) AS DataLength FROM students;
```

**Case Functions**:
```sql
SELECT UPPER(name) AS UpperName, LOWER(name) AS LowerName FROM students;
```

**Substring and Position Functions**:
```sql
SELECT SUBSTRING(name, 1, 5) AS SubName, CHARINDEX('Smith', name) AS Position FROM students;
```

**Concatenation Functions**:
```sql
SELECT CONCAT(name, ', ', address) AS FullInfo FROM students;
SELECT STRING_AGG(name, ', ') AS NameList FROM students;
```

**Trimming Functions**:
```sql
SELECT LTRIM('   Alice') AS TrimmedLeft, RTRIM('Alice   ') AS TrimmedRight;
```

**Left and Right Functions**:
```sql
SELECT LEFT(name, 3) AS LeftPart, RIGHT(name, 3) AS RightPart FROM students;
```

**Replacement Functions**:
```sql
SELECT REPLACE(name, 'Smith', 'Brown') AS NewName FROM students;
```

**Miscellaneous Functions**:
```sql
SELECT STUFF(name, 2, 3, '***') AS StuffedName FROM students;
SELECT REPLICATE('A', 5) AS ReplicatedString;
SELECT SPACE(5) + 'End' AS SpacedString;
```

**Conversion Functions**:
```sql
SELECT CONVERT(VARCHAR, GETDATE(), 101) AS ConvertedDate;
SELECT CAST(12345 AS VARCHAR) AS CastedString;
```

**Parsing Functions**:
```sql
SELECT PARSE('2024-06-30' AS DATE) AS ParsedDate;
SELECT TRY_PARSE('InvalidNumber' AS INT) AS TryParsedNumber;
```

This combined table with categorized functions should provide a clear and comprehensive guide to commonly used string functions in SQL.

Sure, let's break down the commonly used string functions in SQL into a tabular form and provide examples with a sample table. We'll group related functions together under appropriate headings.

### Sample Table

```sql
CREATE TABLE students (
    id INT,
    name VARCHAR(50),
    address VARCHAR(100)
);

INSERT INTO students (id, name, address) VALUES 
(1, 'Alice Johnson', '123 Main St'),
(2, 'Bob Smith', '456 Oak St'),
(3, 'Carol O\'Connor', '789 Pine St');
```

### String Functions

#### Length and Size Functions

| Function       | Syntax                     | Input         | Return Type | One-line Explanation                            | Peculiarities/Considerations                                     |
|----------------|----------------------------|---------------|-------------|-------------------------------------------------|-----------------------------------------------------------------|
| LEN()          | `LEN(expression)`          | String        | Integer     | Returns the number of characters in a string.   | Does not include trailing spaces.                               |
| DATALENGTH()   | `DATALENGTH(expression)`   | String/Binary | Integer     | Returns the number of bytes used to represent an expression. | Includes trailing spaces. Useful for binary data.              |

**Example**:
```sql
SELECT LEN(name) AS NameLength, DATALENGTH(name) AS DataLength FROM students;
```

#### Case Functions

| Function       | Syntax                     | Input   | Return Type | One-line Explanation                 | Peculiarities/Considerations                |
|----------------|----------------------------|---------|-------------|--------------------------------------|--------------------------------------------|
| UPPER()        | `UPPER(expression)`        | String  | String      | Converts all characters to uppercase.| None                                       |
| LOWER()        | `LOWER(expression)`        | String  | String      | Converts all characters to lowercase.| None                                       |

**Example**:
```sql
SELECT UPPER(name) AS UpperName, LOWER(name) AS LowerName FROM students;
```

#### Substring and Position Functions

| Function       | Syntax                                     | Input               | Return Type | One-line Explanation                                   | Peculiarities/Considerations                          |
|----------------|--------------------------------------------|---------------------|-------------|--------------------------------------------------------|------------------------------------------------------|
| SUBSTRING()    | `SUBSTRING(expression, start, length)`     | String, Int, Int    | String      | Extracts a substring from a string.                    | `start` is 1-based index.                            |
| CHARINDEX()    | `CHARINDEX(search_expression, expression)` | String, String      | Integer     | Returns the starting position of a substring.          | Returns 0 if not found.                              |

**Example**:
```sql
SELECT SUBSTRING(name, 1, 5) AS SubName, CHARINDEX('Smith', name) AS Position FROM students;
```

#### Concatenation Functions

| Function       | Syntax                                     | Input         | Return Type | One-line Explanation                 | Peculiarities/Considerations                            |
|----------------|--------------------------------------------|---------------|-------------|--------------------------------------|--------------------------------------------------------|
| CONCAT()       | `CONCAT(expression1, expression2, ...)`    | String        | String      | Concatenates two or more strings.    | NULL values are treated as empty strings.              |
| STRING_AGG()   | `STRING_AGG(expression, separator)`        | String, String| String      | Concatenates values with a separator.| Available in SQL Server 2017 and later.                |

**Example**:
```sql
SELECT CONCAT(name, ', ', address) AS FullInfo FROM students;
SELECT STRING_AGG(name, ', ') AS NameList FROM students;
```

#### Trimming Functions

| Function       | Syntax                     | Input   | Return Type | One-line Explanation                       | Peculiarities/Considerations                          |
|----------------|----------------------------|---------|-------------|--------------------------------------------|------------------------------------------------------|
| LTRIM()        | `LTRIM(expression)`        | String  | String      | Removes leading spaces from a string.      | None                                                 |
| RTRIM()        | `RTRIM(expression)`        | String  | String      | Removes trailing spaces from a string.     | None                                                 |

**Example**:
```sql
SELECT LTRIM('   Alice') AS TrimmedLeft, RTRIM('Alice   ') AS TrimmedRight;
```

#### Left and Right Functions

| Function       | Syntax                     | Input      | Return Type | One-line Explanation                | Peculiarities/Considerations                          |
|----------------|----------------------------|------------|-------------|-------------------------------------|------------------------------------------------------|
| LEFT()         | `LEFT(expression, number)` | String, Int| String      | Returns the left part of a string.  | `number` specifies how many characters to return.    |
| RIGHT()        | `RIGHT(expression, number)`| String, Int| String      | Returns the right part of a string. | `number` specifies how many characters to return.    |

**Example**:
```sql
SELECT LEFT(name, 3) AS LeftPart, RIGHT(name, 3) AS RightPart FROM students;
```

#### Replacement Functions

| Function       | Syntax                                     | Input                     | Return Type | One-line Explanation                | Peculiarities/Considerations                          |
|----------------|--------------------------------------------|---------------------------|-------------|-------------------------------------|------------------------------------------------------|
| REPLACE()      | `REPLACE(expression, search, replace)`     | String, String, String    | String      | Replaces all occurrences of a substring. | Case-sensitive.                                      |

**Example**:
```sql
SELECT REPLACE(name, 'Smith', 'Brown') AS NewName FROM students;
```

#### Miscellaneous Functions

| Function       | Syntax                                     | Input             | Return Type | One-line Explanation                | Peculiarities/Considerations                          |
|----------------|--------------------------------------------|-------------------|-------------|-------------------------------------|------------------------------------------------------|
| STUFF()        | `STUFF(expression, start, length, replace)`| String, Int, Int, String | String      | Deletes part of a string and inserts another. | `start` is 1-based index.                            |
| REPLICATE()    | `REPLICATE(expression, count)`             | String, Int       | String      | Repeats a string a specified number of times. | None                                                 |
| SPACE()        | `SPACE(count)`                             | Int               | String      | Returns a string of repeated spaces. | None                                                 |

**Example**:
```sql
SELECT STUFF(name, 2, 3, '***') AS StuffedName FROM students;
SELECT REPLICATE('A', 5) AS ReplicatedString;
SELECT SPACE(5) + 'End' AS SpacedString;
```

#### Conversion Functions

| Function       | Syntax                     | Input      | Return Type | One-line Explanation                | Peculiarities/Considerations                          |
|----------------|----------------------------|------------|-------------|-------------------------------------|------------------------------------------------------|
| CONVERT()      | `CONVERT(data_type, expression)` | Any     | Specified data type | Converts a value to a specified data type. | Commonly used for date and string conversions.       |
| CAST()         | `CAST(expression AS data_type)` | Any     | Specified data type | Converts a value to a specified data type. | Standard SQL syntax for conversions.                 |

**Example**:
```sql
SELECT CONVERT(VARCHAR, GETDATE(), 101) AS ConvertedDate;
SELECT CAST(12345 AS VARCHAR) AS CastedString;
```

#### Parsing Functions

| Function       | Syntax                                     | Input             | Return Type | One-line Explanation                | Peculiarities/Considerations                          |
|----------------|--------------------------------------------|-------------------|-------------|-------------------------------------|------------------------------------------------------|
| PARSE()        | `PARSE(expression AS data_type)`           | String            | Specified data type | Converts a string to a specified data type. | Suitable for converting string representations of dates and numbers. |
| TRY_PARSE()    | `TRY_PARSE(expression AS data_type)`       | String            | Specified data type | Tries to convert a string to a specified data type. | Returns NULL if conversion fails, avoiding errors.    |

**Example**:
```sql
SELECT PARSE('2024-06-30' AS DATE) AS ParsedDate;
SELECT TRY_PARSE('InvalidNumber' AS INT) AS TryParsedNumber;
```

This tabular format covers commonly used string functions in SQL, providing syntax, input, return type, a brief explanation, and any special considerations. The examples use a sample table to illustrate how each function works in practice.